Revit 2027 API
Group.HideAllAttachedDetailGroups Method
 Hides all the available attached detail groups for this element group type that are compatible with the input view type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void HideAllAttachedDetailGroups(
	View view
)
Public Sub HideAllAttachedDetailGroups (
	view As View
)
public:
void HideAllAttachedDetailGroups(
	View^ view
)
member HideAllAttachedDetailGroups :
        view : View -> unit
Parameters
view View
 The view that the attached detail groups must be compatible with.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The input group is not a model group and can therefore not have attached detail groups.
See Also
Reference
Group Class
Autodesk.Revit.DB Namespace